Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartNotAttachedToStraight Property
 The part must be attached to straight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartNotAttachedToStraight { get; }
Public Shared ReadOnly Property FabricationPartNotAttachedToStraight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartNotAttachedToStraight {
	FailureDefinitionId^ get ();
}
static member FabricationPartNotAttachedToStraight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace